// Написать скрипт генерации данных тестового пользователя
// 1. Создать переменные:
// Имя (String)
// Фамилия (String)
// Возраст (Number)
// Статус (Boolean)
// 2. Составить email на основе имени и фамилии (@test.com)
// 3. Вычислить год рождения юзера (знаю текущий год и возраст юзера)
// 4. Сделать понятные и информативные комментарии
// 5. Вывести итоговую карточку юзера в консоль с помощью шаблонных строк
// ⭐ Написать логику, чтобы фамиля и имя всегда выводились идеально (первая- большая, остальные маленькие, без
// пробелов) даже если на вход в переменных что-то такое (" иВАн " ," иВаНоВ")

// 1 - создание переменных
const name = ' AleX';
const surname = 'brOwn ';
const age = 25;
const status = true;

// 2 - составление эмэйла (приводим к нижнему регистру и убираем пробелы по бокам)
const email = `${name.toLowerCase().trim()}.${surname.toLowerCase().trim()}@test.com`;

// 3 - вычисление года рождения юзера (получаем текущий год и из него вычитаем возраст)
const currentYear = new Date().getFullYear();
const birthYear = currentYear - age;

// 5 & 6
const nameFixed = name.toLowerCase().trim() // приводим имя и фамилию к нижнему регистру и убираем пробелы
const surnameFixed = surname.toLowerCase().trim()
// получаем 1-ую букву и приводим ее к верхнему регистру, с помощью slice(1) добавляем
// остальную часть начиная со 2-ой буквы
console.log(`---Карточка пользователя---
Имя: ${nameFixed[0].toUpperCase()}${nameFixed.slice(1)} 
Фамилия: ${surnameFixed[0].toUpperCase()}${surnameFixed.slice(1)}
Email: ${email}
Status: ${status ? 'Активен' : 'Неактивен'} 
Возраст: ${age}
Год рождения: ${birthYear}`);


